package HW11;
/*
TODO 1. Написать метод, который меняет два элемента массива местами (массив может быть любого ссылочного типа);
TODO 2. Написать метод, который преобразует массив в ArrayList;
TODO 3. Задача:
TODO a. Даны классы Fruit, Apple extends Fruit, Orange extends Fruit;
TODO b. Класс Box, в который можно складывать фрукты. Коробки условно сортируются по типу фрукта, поэтому в одну коробку нельзя сложить и яблоки, и апельсины;
TODO c. Для хранения фруктов внутри коробки можно использовать ArrayList;
TODO d. Сделать метод getWeight(), который высчитывает вес коробки, зная вес одного фрукта и их количество: вес яблока – 1.0f, апельсина – 1.5f (единицы измерения не важны);
TODO e. Внутри класса Box сделать метод compare(), который позволяет сравнить текущую коробку с той, которую подадут в compare() в качестве параметра. true – если их массы равны, false в противоположном случае. Можно сравнивать коробки с яблоками и апельсинами;
TODO f. Написать метод, который позволяет пересыпать фрукты из текущей коробки в другую. Помним про сортировку фруктов: нельзя яблоки высыпать в коробку с апельсинами. Соответственно, в текущей коробке фруктов не остается, а в другую перекидываются объекты, которые были в первой;
TODO g. Не забываем про метод добавления фрукта в коробку.
*/
public class Main {
    public static void main(String[] args) {
        System.out.println("=HW11=");
    }
}
