package HW9;
/*
TODO Напишите метод, на вход которого подаётся двумерный строковый массив размером 4х4.
 При подаче массива другого размера необходимо бросить исключение MyArraySizeException.
TODO Далее метод должен пройтись по всем элементам массива, преобразовать в int и просуммировать.
 Если в каком-то элементе массива преобразование не удалось (например, в ячейке лежит символ или текст вместо числа),
 должно быть брошено исключение MyArrayDataException с детализацией, в какой именно ячейке лежат неверные данные.
TODO В методе main() вызвать полученный метод, обработать возможные исключения MyArraySizeException и MyArrayDataException
 и вывести результат расчета.
*/
public class Main {
    public static void main(String[] args) {
        System.out.println("=HW9=");
    }
}
